Dlubal.RFEM5.Node
Node parameters

Dlubal.RFEM5.Node.No
Number

Dlubal.RFEM5.Node.ID
Identifier

Dlubal.RFEM5.Node.Comment
Comment

Dlubal.RFEM5.Node.Tag
Tag

Dlubal.RFEM5.Node.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Node.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Node.RefObjectNo
Reference object number

Dlubal.RFEM5.Node.X
Coordinate X

Dlubal.RFEM5.Node.Y
Coordinate Y

Dlubal.RFEM5.Node.Z
Coordinate Z

Dlubal.RFEM5.Node.CS
Type of coordinate system

Dlubal.RFEM5.Node.Type
Type of node

Dlubal.RFEM5.Node.Delta1
Parameter δ1

Dlubal.RFEM5.Node.Delta2
Parameter δ2